# Александр LyraX: 2. Площадь
# Пользователь вводит стороны прямоугольника, выведите его площадь
#


#  1 задача
# Александр LyraX: 1. Сумма трех
# Посчитайте сумму трех введенных целых чисел
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("введите третье число: "))
#
# print(f"сумма трех чисел {a} + {b} + {c}: {a+b+c}")

# 3 задача
# Александр LyraX: 3. 1. Одинаковая четность
# Даны два целых числа: A, B. Проверить истинность высказывания: "Числа A и B имеют одинаковую четность".'''

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# if a%2 == b%2:
#     print(f"Числа {a} и {b} имеют одинаковую четность")
# else:
#     print(f"Числа {a} и {b} не имеют одинаковой четности")

# Александр LyraX: 4. Одно положительное
# Даны три целых числа: A, B, C. Проверить истинность высказывания: "Хотя бы одно из чисел A, B, C положительное".
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("введите третье число: "))
# if a >0 or b >0 or c >0:
#     print(f"Хотя бы одно из чисел {a} {b} {c} положительное")
# else:
#     print(f"ни одно из чисел {a} {b} {c} не положительное")

# Александр LyraX: 5 Меньшее из двух
# Пользователь вводит два целых числа. Выведите меньшее из них.
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# print(f"Меньшее из двух чисел {a}") if a < b else print(f"Меньшее из них чисел {b}")

# Александр LyraX: 6.Четырехзначное?
# Пользователь вводит целое число. Выведите YES, если это число является четырехзначным, и NO в противном случае.
# a = int(input("Введите число: "))
# counter = 0
# a = abs(a)
# while a != 0:
#     a //= 10
#     counter += 1
# if counter == 4:
#     print("Число является четырехзначным")
# else:
#     print("Число не является четырехзначным")
